# Recap
- imported `pandas` 
- created a `DataFrame`
- counted the no of rows and columns in our `DataFrame`
- Displayed the first 3 rows of our `DataFrame`

In [63]:
import pandas as pd

In [65]:
student_data = (
    [101, 'Ulysses', 13],
    [53, 'William', 10],
    [128, 'Henry', 6],
    [3, 'Henry',  11])

In [131]:
student_data_columns = ('student_id', 'name', 'age')

In [133]:
df = pd.DataFrame(data=student_data, columns=student_data_columns)

In [135]:
df

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11

to select a specific column from our `df` we can do df('name of column')

In [138]:
df['student_id'] == 101

0     True
1    False
2    False
3    False
Name: student_id, dtype: bool

In [140]:
df.loc[df['student_id'] == 101, ['name', 'age']]

      name  age
0  Ulysses   13

# new function `.loc()`
the first argument is the condition would want to filter by.
ex. df[student_id]
the second argument is the columns you want to display.

In [144]:
df

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11

In [155]:
df['age']

0    13
1    10
2     6
3    11
Name: age, dtype: int64

In [157]:
df['age_in_dog_years'] = df['age'] * 7.5

In [150]:
df

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11